redyuan43/VibeStick/firmware/sticks3/sdkconfig.defaults.cardputer_adv
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Cardputer-Adv uses ESP32-S3FN8 and has no external PSRAM.
# CONFIG_SPIRAM is not set
CONFIG_LV_FONT_SIMSUN_14_CJK=y
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=65
CONFIG_LV_FS_STDIO_PATH="/sdcard"
CONFIG_LV_FS_STDIO_CACHE_SIZE=512
# CONFIG_LV_USE_TINY_TTF is not set
# Cardputer-Adv has no PSRAM. Use FATFS' shared sector cache instead of a
# 4 KiB cache in every open FIL object.
# CONFIG_FATFS_PER_FILE_CACHE is not set
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=64

# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota_1800k.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_ota_1800k.csv"
